Бух_тест/src/Reports/РегламентированныйОтчетФорма1ДФ/РегламентированныйОтчетФорма1ДФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегламентированныйОтчетФорма1ДФ</name>
  <comment>Расчетная ведомость по форме № 1ДФ</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыплатыЗПНеРегулярны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыплатыНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыплатыКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьЧПников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьПоИНН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВзносыФОТКакДоход133</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Бух_тест/src/Reports/РегламентированныйОтчетФорма1ДФ/Forms/ПараметрыОтчета2015УФ/Module.bsl
// ПриСозданииНаСервере()
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мПараметры = Новый Структура();
	
	мСпрашиватьОСохранении = Истина;
	мПрограммноеЗакрытие   = Ложь;
	
	Организация = Параметры.Организация;
	
	ДатаВыплатыНач 			= Параметры.ДатаВыплатыНач;
	ДатаВыплатыКон 			= Параметры.ДатаВыплатыКон;
	НеВключатьЧПников 		= Параметры.НеВключатьЧПников;
	ВыплатыЗПНеРегулярны 	= Параметры.ВыплатыЗПНеРегулярны;
	Подразделение 			= Параметры.Подразделение;
	СортироватьПоИНН		= Параметры.СортироватьПоИНН;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Элементы", Элементы);
	СтруктураПараметров.Вставить("ВыплатыЗПНеРегулярны", ВыплатыЗПНеРегулярны);
	СтруктураПараметров.Вставить("Подразделение", Подразделение);
		
	УправлениеЭУ(СтруктураПараметров);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеЭУ(СтруктураПараметров)
	
	СтруктураПараметров.Элементы.ПараметрыВыплаты.Видимость  = НЕ СтруктураПараметров.ВыплатыЗПНеРегулярны;
	СтруктураПараметров.Элементы.НеВключатьЧПников.Видимость = ЗначениеЗаполнено(СтруктураПараметров.Подразделение);
	
КонецПроцедуры // УправлениеЭУ()

// Сохранить()
//
&НаКлиенте
Процедура Сохранить(Команда)
	
	мСпрашиватьОСохранении = Ложь;
	Закрыть();
	
КонецПроцедуры // Сохранить()

// ПередЗакрытием()
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если мПрограммноеЗакрытие = Истина Тогда
		Возврат;
	КонецЕсли;
			
	Если мСпрашиватьОСохранении <> Ложь И Модифицированность Тогда
		
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Настройки были изменены. Сохранить изменения?';uk='Настройки були змінені. Зберегти зміни?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
		
	ИначеЕсли мСпрашиватьОСохранении <> Ложь И НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	ДействияПриЗакрытии();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриЗакрытии()
	
	ВладелецФормы.СтруктураРеквизитовФормы.ДатаВыплатыКон 			= ДатаВыплатыКон;
	ВладелецФормы.СтруктураРеквизитовФормы.ДатаВыплатыНач 			= ДатаВыплатыНач;
	ВладелецФормы.СтруктураРеквизитовФормы.Подразделение 			= Подразделение;
	ВладелецФормы.СтруктураРеквизитовФормы.ВыплатыЗПНеРегулярны 	= ВыплатыЗПНеРегулярны;
	ВладелецФормы.СтруктураРеквизитовФормы.НеВключатьЧПников 		= НеВключатьЧПников;
	ВладелецФормы.СтруктураРеквизитовФормы.СортироватьПоИНН 		= СортироватьПоИНН;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("РегламентированнаяОтчетность", "РегламентированнаяОтчетность_1ДФ_ВыплатыЗПНеРегулярны", ВыплатыЗПНеРегулярны);	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("РегламентированнаяОтчетность", "РегламентированнаяОтчетность_1ДФ_ЧислоВыплатыЗП", 	  День(ДатаВыплатыКон));	
	
	мПрограммноеЗакрытие = Истина;
	Отказ = Истина;
	
	ПараметрыВозврата = Новый Структура();
	
	Закрыть(ПараметрыВозврата);
	
КонецПроцедуры // ПередЗакрытием()

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры)Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		мПрограммноеЗакрытие = Истина;
		Закрыть();
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ДействияПриЗакрытии();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыЗПНеРегулярныПриИзменении(Элемент)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Элементы", Элементы);
	СтруктураПараметров.Вставить("ВыплатыЗПНеРегулярны", ВыплатыЗПНеРегулярны);
	СтруктураПараметров.Вставить("Подразделение", Подразделение);
		
	УправлениеЭУ(СтруктураПараметров);
	
	Модифицированность = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		НеВключатьЧПников = Истина;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Элементы", Элементы);
	СтруктураПараметров.Вставить("ВыплатыЗПНеРегулярны", ВыплатыЗПНеРегулярны);
	СтруктураПараметров.Вставить("Подразделение", Подразделение);
		
	УправлениеЭУ(СтруктураПараметров);
	
КонецПроцедуры
